ＮＡＳ　複数のＰＣからデータを共有しているファイルサーバ

ＳＡＮ　補助記憶装置を接続する高速のネットワーク。ＬＡＮを使用しないのでネットワーク負荷を減らせる

シンクライアント最低限な機能で低価格のＰＣでサーバに接続し、サーバの負荷減らすことで、ウイルスに感染するリスクを避ける

RAID0 ストライピング。データを複数のディスクに分散して書き込む。処理速度上げ

ＲＡＩＤ１　ミラーリング。同じデータを２つのディスクに書き込む

ＲＡＩＤ２RAID0で保存し、復旧用にハミング符号使う

ＲＡＩＤ３ＲＡＩＤ０で保存、復旧用にパリティビット使う

ＲＡＩＤ４RAID3はビット単位で保存、ＲＡＩＤ４はブロック単位で保存

ＲＡＩＤ５2~4は修正用を専用のドライブに保存、5は修正用データをデータ保存用に分けて保存

RAID6 RAID5の改良版で、鰓０修正用のデータが２重で保存

ターンアラウンドタイム＞レスポンスタイム

ベンチマークテスト　負荷状態の処理速度計測し、処理性能の改善目的

ボトルネック　システム全体の処理速度下げている要因

キャパシティプランニング　システムの応答時間計測し、将来のシステムを維持できるように改善する

モニタリング　各プログラムの実行状態を測定し、システムを改善するデータを得ること

(改善することはキャパシティランニング　測定し、改善するためのデータ得ることはモニタリング